## TERRAGRUNT Plan Output
<details><summary>Click to expand</summary>

```terraform
[command]/home/runner/work/_temp/e726106d-a3ea-4822-a7d1-b1d9c0669a1a/terraform-bin plan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # aws_s3_bucket.test_2[0m will be created
[0m  [32m+[0m[0m resource "aws_s3_bucket" "test_2" {
      [32m+[0m[0m acceleration_status         = (known after apply)
      [32m+[0m[0m acl                         = (known after apply)
      [32m+[0m[0m arn                         = (known after apply)
      [32m+[0m[0m bucket                      = "my-bucket"
      [32m+[0m[0m bucket_domain_name          = (known after apply)
      [32m+[0m[0m bucket_prefix               = (known after apply)
      [32m+[0m[0m bucket_regional_domain_name = (known after apply)
      [32m+[0m[0m force_destroy               = false
      [32m+[0m[0m hosted_zone_id              = (known after apply)
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m object_lock_enabled         = (known after apply)
      [32m+[0m[0m policy                      = (known after apply)
      [32m+[0m[0m region                      = (known after apply)
      [32m+[0m[0m request_payer               = (known after apply)
      [32m+[0m[0m tags                        = {
          [32m+[0m[0m "Enviroment" = "Dev"
          [32m+[0m[0m "Name"       = "My bucket"
        }
      [32m+[0m[0m tags_all                    = {
          [32m+[0m[0m "Enviroment" = "Dev"
          [32m+[0m[0m "Name"       = "My bucket"
        }
      [32m+[0m[0m website_domain              = (known after apply)
      [32m+[0m[0m website_endpoint            = (known after apply)
    }

[1m  # aws_s3_object.test_2[0m will be created
[0m  [32m+[0m[0m resource "aws_s3_object" "test_2" {
      [32m+[0m[0m acl                    = (known after apply)
      [32m+[0m[0m bucket                 = "my-bucket"
      [32m+[0m[0m bucket_key_enabled     = (known after apply)
      [32m+[0m[0m checksum_crc32         = (known after apply)
      [32m+[0m[0m checksum_crc32c        = (known after apply)
      [32m+[0m[0m checksum_sha1          = (known after apply)
      [32m+[0m[0m checksum_sha256        = (known after apply)
      [32m+[0m[0m content_type           = (known after apply)
      [32m+[0m[0m etag                   = (known after apply)
      [32m+[0m[0m force_destroy          = false
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m key                    = "terraform.tfstate"
      [32m+[0m[0m kms_key_id             = (known after apply)
      [32m+[0m[0m server_side_encryption = (known after apply)
      [32m+[0m[0m source                 = "terraform.tfstate"
      [32m+[0m[0m storage_class          = (known after apply)
      [32m+[0m[0m tags_all               = (known after apply)
      [32m+[0m[0m version_id             = (known after apply)
    }

[1mPlan:[0m 2 to add, 0 to change, 0 to destroy.
[0m[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mAWS account ID not found for provider[0m
[33m│[0m [0m
[33m│[0m [0m[0m  with provider["registry.terraform.io/hashicorp/aws"],
[33m│[0m [0m  on provider.tf line 2, in provider "aws":
[33m│[0m [0m   2: provider "aws" [4m{[0m[0m
[33m│[0m [0m
[33m│[0m [0mSee
[33m│[0m [0mhttps://registry.terraform.io/providers/hashicorp/aws/latest/docs#skip_requesting_account_id
[33m│[0m [0mfor implications.
[33m╵[0m[0m
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  [32m+[0m create[0m%0A%0ATerraform will perform the following actions:%0A%0A[1m  # aws_s3_bucket.test_2[0m will be created%0A[0m  [32m+[0m[0m resource "aws_s3_bucket" "test_2" {%0A      [32m+[0m[0m acceleration_status         = (known after apply)%0A      [32m+[0m[0m acl                         = (known after apply)%0A      [32m+[0m[0m arn                         = (known after apply)%0A      [32m+[0m[0m bucket                      = "my-bucket"%0A      [32m+[0m[0m bucket_domain_name          = (known after apply)%0A      [32m+[0m[0m bucket_prefix               = (known after apply)%0A      [32m+[0m[0m bucket_regional_domain_name = (known after apply)%0A      [32m+[0m[0m force_destroy               = false%0A      [32m+[0m[0m hosted_zone_id              = (known after apply)%0A      [32m+[0m[0m id                          = (known after apply)%0A      [32m+[0m[0m object_lock_enabled         = (known after apply)%0A      [32m+[0m[0m policy                      = (known after apply)%0A      [32m+[0m[0m region                      = (known after apply)%0A      [32m+[0m[0m request_payer               = (known after apply)%0A      [32m+[0m[0m tags                        = {%0A          [32m+[0m[0m "Enviroment" = "Dev"%0A          [32m+[0m[0m "Name"       = "My bucket"%0A        }%0A      [32m+[0m[0m tags_all                    = {%0A          [32m+[0m[0m "Enviroment" = "Dev"%0A          [32m+[0m[0m "Name"       = "My bucket"%0A        }%0A      [32m+[0m[0m website_domain              = (known after apply)%0A      [32m+[0m[0m website_endpoint            = (known after apply)%0A    }%0A%0A[1m  # aws_s3_object.test_2[0m will be created%0A[0m  [32m+[0m[0m resource "aws_s3_object" "test_2" {%0A      [32m+[0m[0m acl                    = (known after apply)%0A      [32m+[0m[0m bucket                 = "my-bucket"%0A      [32m+[0m[0m bucket_key_enabled     = (known after apply)%0A      [32m+[0m[0m checksum_crc32         = (known after apply)%0A      [32m+[0m[0m checksum_crc32c        = (known after apply)%0A      [32m+[0m[0m checksum_sha1          = (known after apply)%0A      [32m+[0m[0m checksum_sha256        = (known after apply)%0A      [32m+[0m[0m content_type           = (known after apply)%0A      [32m+[0m[0m etag                   = (known after apply)%0A      [32m+[0m[0m force_destroy          = false%0A      [32m+[0m[0m id                     = (known after apply)%0A      [32m+[0m[0m key                    = "terraform.tfstate"%0A      [32m+[0m[0m kms_key_id             = (known after apply)%0A      [32m+[0m[0m server_side_encryption = (known after apply)%0A      [32m+[0m[0m source                 = "terraform.tfstate"%0A      [32m+[0m[0m storage_class          = (known after apply)%0A      [32m+[0m[0m tags_all               = (known after apply)%0A      [32m+[0m[0m version_id             = (known after apply)%0A    }%0A%0A[1mPlan:[0m 2 to add, 0 to change, 0 to destroy.%0A[0m[33m╷[0m[0m%0A[33m│[0m [0m[1m[33mWarning: [0m[0m[1mAWS account ID not found for provider[0m%0A[33m│[0m [0m%0A[33m│[0m [0m[0m  with provider["registry.terraform.io/hashicorp/aws"],%0A[33m│[0m [0m  on provider.tf line 2, in provider "aws":%0A[33m│[0m [0m   2: provider "aws" [4m{[0m[0m%0A[33m│[0m [0m%0A[33m│[0m [0mSee%0A[33m│[0m [0mhttps://registry.terraform.io/providers/hashicorp/aws/latest/docs#skip_requesting_account_id%0A[33m│[0m [0mfor implications.%0A[33m╵[0m[0m%0A[90m%0A─────────────────────────────────────────────────────────────────────────────[0m%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>